{
  "metadata": {
    "generated_timestamp": "2024-02-13T10:00:00Z",
    "company_name": "Test - Company Name development changedv 2",
    "format_version": "operations",
    "total_operations": 12,
    "generator": "PolicyWorkflow v2.0",
    "logo_path": "edits/user_1755871308444_qzzu61_company_logo.png"
  },
  "instructions": {
    "operations": [
      {
        "target_text": "<Company Name>",
        "action": "replace",
        "replacement": "Test - Company Name development changedv 2",
        "comment": "Replaced",
        "comment_author": "Secfix AI"
      },
      {
        "target_text": "<Company name, address>",
        "action": "replace",
        "replacement": "Test - Company Name development changedv 2, Test - Company Name development changed 2",
        "comment": "Replaced",
        "comment_author": "Secfix AI"
      },
      {
        "target_text": "[ADD COMPANY LOGO]",
        "action": "replace_with_logo",
        "replacement": "",
        "comment": "Company logo inserted from questionnaire upload",
        "comment_author": "Secfix AI"
      },
      {
        "target_text": "Guest Network Access: Visitors to the Company can access guest networks by registering with the office personnel, bypassing the need for a formal access request.",
        "action": "delete",
        "replacement": "",
        "comment": "You indicated that you do not have an office, so guest network access section should be removed. No office = no guest network needed; Having office = visitors need controlled network access for security.",
        "comment_author": "Secfix AI"
      },
      {
        "target_text": "Password management systems should be user-friendly",
        "action": "replace",
        "replacement": "Password management systems, specifically Test - Company Name development, should be user-friendly",
        "comment": "You indicated you use a custom password management solution, so the generic reference should be updated to specify your tool. No password tool = section removed; Using specific tool = policy references actual system rather than generic language.",
        "comment_author": "Secfix AI"
      },
      {
        "target_text": "All requests will be sent by email to <email>",
        "action": "replace",
        "replacement": "All requests will be submitted through Test - Company Name development changed ticketing system",
        "comment": "You indicated using a custom ticketing system for access requests. Ticketing system = proper audit trails and tracking; Email = simple but no tracking; Chat = fast but informal.",
        "comment_author": "Secfix AI"
      },
      {
        "target_text": "a quarterly basis",
        "action": "replace",
        "replacement": "an annual basis",
        "comment": "You selected annual instead of quarterly basis. We recommend quarterly reviews for most companies. If you operate in highly critical industries with complex or large company structure (1000+ employees), you might consider monthly reviews. Small companies and startups can get away with annual reviews. Pick any frequency that works for your company. Auditors only care that you consistently follow whatever schedule you document here.",
        "comment_author": "Secfix AI"
      },
      {
        "target_text": "<24 business hours>",
        "action": "replace",
        "replacement": "Test - Company Name development",
        "comment": "You specified a custom termination timeframe. We recommend 24 business hours for most companies. Consider shorter timelines if customers request it. Longer than 1 week looks suspicious to auditors. You only get a non-conformity for not meeting your documented timeframe, not for choosing the wrong timeframe.",
        "comment_author": "Secfix AI"
      },
      {
        "target_text": "<owner>",
        "action": "replace",
        "replacement": "Test - Company Name development changed",
        "comment": "You indicated that Test - Company Name development changed is the owner of this access control policy, so the owner placeholder needs to be replaced. This person is the enforcer of the policy. If your employees have questions about the policy, that person should be easily identified by employees and prepared to answer any of their questions regarding the policy.",
        "comment_author": "Secfix AI"
      },
      {
        "target_text": "<Exceptions: IT Manager>",
        "action": "replace",
        "replacement": "Test - Company Name development",
        "comment": "You indicated a custom role for approving exceptions to this policy, so the IT Manager placeholder should be updated. Can be the same person as violations reporting section. For audit it's only important to define it. Auditors will not issue a non-conformity for wrong selection - select what works best for you here.",
        "comment_author": "Secfix AI"
      },
      {
        "target_text": "<Violations: IT Manager>",
        "action": "replace",
        "replacement": "Test - Company Name development",
        "comment": "You indicated a custom role for handling policy violations, so the IT Manager placeholder should be updated. Can be the same person as exception approval section. For audit it's only important to define it. Auditors will not issue a non-conformity for wrong selection - select what works best for you here.",
        "comment_author": "Secfix AI"
      },
      {
        "target_text": "Access to Program Source Code",
        "action": "comment",
        "comment": "You indicated you use Azure DevOps for version control, so this section should remain. No version control = no source code to protect; Using version control = IP protection needed.",
        "comment_author": "Secfix AI"
      }
    ]
  }
}